app/controllers/speeds_controller.rb

  def index
    @speeds = Speed.all
---
SELECT "speeds".* FROM "speeds"

  def create
    speed_txt = params[:speed_txt]

    down = speed_txt.match(/(\d+\.\d+).*(\d+\.\d+)/)[1]
    up   = speed_txt.match(/(\d+\.\d+).*(\d+\.\d+)/)[2]

    @speed = Speed.new(speed_params)
    @speed.down = down
    @speed.up   = up

    respond_to do |format|
      if @speed.save
---
INSERT INTO "speeds" ("date", "time", "down", "up", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2016-02-18"], ["time", "2016-02-18 17:13:00.000000"], ["down", 10.19], ["up", 3.79], ["created_at", "2016-02-18 08:13:56.874244"], ["updated_at", "2016-02-18 08:13:56.874244"]]

  def destroy
    @speed.destroy
---
DELETE FROM "speeds" WHERE "speeds"."id" = ?  [["id", 3]]

    def set_speed
      @speed = Speed.find(params[:id])
---
SELECT  "speeds".* FROM "speeds" WHERE "speeds"."id" = ? LIMIT 1  [["id", 3]]