app/controllers/traffics_controller.rb

SELECT "traffics".* FROM "traffics"
---
  def index
    @traffics = Traffic.all

SELECT  "traffics".* FROM "traffics" WHERE "traffics"."date" = ? LIMIT 1  [["date", "01/19/16"]]
DELETE FROM "traffics" WHERE "traffics"."id" = ?  [["id", 59]]
INSERT INTO "traffics" ("date", "r", "s", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "01/19/16"], ["r", 0], ["s", 0], ["created_at", "2016-02-17 06:05:32.311926"], ["updated_at", "2016-02-17 06:05:32.311926"]]
SELECT "traffics".* FROM "traffics"
---
  def create
    data = "date,r,s\r\n"+params[:data]
    csv = CSV.new(data, :headers => true, :header_converters => :symbol, :converters => :all)

    h = csv.to_a.map {|row| row.to_hash }

    h.each do |e|
      t = Traffic.find_by date:e[:date]
      if t!=nil
        t.delete
      end
      Traffic.create(e)
    end

    @traffics = Traffic.all

DELETE FROM "traffics" WHERE "traffics"."id" = ?  [["id", 60]]
---
  def destroy
    @traffic.destroy

SELECT  "traffics".* FROM "traffics" WHERE "traffics"."id" = ? LIMIT 1  [["id", 60]]
---
    def set_traffic
      @traffic = Traffic.find(params[:id])